// 패키지 선언 : 해당 파일(클래스)이 해당 패키지 내에 위치합니다.
package com.test.java;

// 클래스 : 코드의 집합
public class Ex02 { //K&R Kernighan and Ritchie

	// 메소드 : 클래스 하위에 있는 코드의 집합
	public static void main(String[] args) 
	
	{ //BSD, Allman
		
		System.out.println("안녕하세요.");
		
		/* 식별자 명명 규칙 
		
		- 작업 때 여러가지 요소의 이름을 짓게 된다. 이름을 지을 때 지켜야 하는 규칙
		- 폴더명, 파일명, 클래스명, 메소드명, 변수명 등등... 모든 이름
		- 1. 영문자 + 숫자 + _
		- 2. 숫자로 시작 불가 (_바로 시작한 뒤 숫자를 붙이는건 가능)
		- 3. 의미 있게*** + 약어 사용 금지, 무조건 풀네임 작성
		 
		 */
		
		/* 들여쓰기 규칙
		
		1. 탭문자
		- 작성이 편함
		- 환경에 따라 여백의 길이가 다르게 출력
		
		2. 스페이스
		- 작성이 불편함
		- 환경에 상관없이 일정한 길이로 출력
		 
		*/
			
	}
	
}
